SoapRequest/PartyVerificationOrganisation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://hollard.co.za/PartyVerificationService/" xmlns:par1="http://hollard.co.za/Schema/Types/Party">
	<soapenv:Header/>
	<soapenv:Body>
		<par:ScreenAndVerifyParty xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
			<par:ScreenAndVerifyOperationType>ScreenAndVerify</par:ScreenAndVerifyOperationType>
			<par:Channel>Branch</par:Channel>
			<par:Product>FuneralWithRiders</par:Product>
			<par:AnnualPremium>0</par:AnnualPremium>
			<par:PremiumCollectionMethod>DebitOrder</par:PremiumCollectionMethod>
			<par:ExternalReference>12345</par:ExternalReference>
			<par:MaxCacheAge>0</par:MaxCacheAge>
			<par:PartyList>
				<par1:Party i:type="par1:Organization">
					<par1:DirectorList>
						<par1:Director>
							<par1:PartyId>1</par1:PartyId>					 
							<par1:GivenName>dpip</par1:GivenName>					 
							<par1:Surname>Vorster</par1:Surname>					 				 
							<par1:IdentityNumber>
								<par1:IdentityType>NationalIdentityNumber</par1:IdentityType>						 
								<par1:IdentityNumber>7409075013082</par1:IdentityNumber>						 
								<par1:IssueCountry>RSA</par1:IssueCountry>						 
							</par1:IdentityNumber>					 				 					 
							<par1:HomePhysicalAddress>
								<par1:AddressLine1>10 Schoongezicht</par1:AddressLine1>						 
								<par1:AddressLine2>Watson Street</par1:AddressLine2>						 
								<par1:AddressLine3>Helderkruin</par1:AddressLine3>						 
							</par1:HomePhysicalAddress>					 				 					 
						</par1:Director>
						<par1:Director>
							<par1:PartyId>2</par1:PartyId>					 
							<par1:GivenName>Michiel</par1:GivenName>					 
							<par1:Surname>Vorster</par1:Surname>					 				 
							<par1:IdentityNumber>
								<par1:IdentityType>NationalIdentityNumber</par1:IdentityType>						 
								<par1:IdentityNumber>7409075013082</par1:IdentityNumber>						 
								<par1:IssueCountry>RSA</par1:IssueCountry>						 
							</par1:IdentityNumber>					 				 					 
							<par1:HomePhysicalAddress>
								<par1:AddressLine1>10 Schoongezicht</par1:AddressLine1>						 
								<par1:AddressLine2>Watson Street</par1:AddressLine2>						 
								<par1:AddressLine3>Helderkruin</par1:AddressLine3>						 
							</par1:HomePhysicalAddress>					 				 					 
						</par1:Director>
					</par1:DirectorList>				
				</par1:Party>
			</par:PartyList>
		</par:ScreenAndVerifyParty>
	</soapenv:Body>
</soapenv:Envelope>